Revit 2024 API
BuiltInFailures.OpeningFailures.HostForCutHasNoGeometry Property
 Host can't be cut because it has no geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId HostForCutHasNoGeometry { get; }
Visual Basic
Public Shared ReadOnly Property HostForCutHasNoGeometry As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ HostForCutHasNoGeometry {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace